//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="正在執行步驟 %d/%d：正在建立實體商店";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="正在執行步驟 %d/%d：正在建立啟動載入資料庫";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="正在執行步驟 %d/%d：正在建立請求佇列資料庫";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="正在執行步驟 %d/%d：正在下載實體儲存。目前已接收 %s/%s。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="正在執行步驟 %d/%d：正在清除過期請求";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="正在執行步驟 %d/%d：正在載入中繼資料";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="正在執行步驟 %d/%d：正在執行請求佇列合併";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="正在執行步驟 %d/%d：正在執行交易合併";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="正在執行步驟 %d/%d：正在執行建立刪除合併";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="正在執行步驟 %d/%d：正在處理定義查詢 %s (使用 %s)";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="正在執行步驟 %d/%d：正在處理請求。正在傳送 %s/%s 個修改請求。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="正在執行步驟 %d/%d：正在重新套用更改";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="正在執行步驟 %d/%d：正在分析收到的資料";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="正在執行步驟 %d/%d：正在從伺服器接收資料。目前已收到 %s。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="正在執行步驟 %d/%d：正在移除刪除的關係";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="正在執行步驟 %d/%d：正在移除指定為 RemoveAfterUpload 的請求";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="正在執行步驟 %d/%d：將資料傳送至伺服器。目前已傳送 %s。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="正在執行步驟 %d/%d：正在傳送實體儲存資料庫。目前已傳送 %s/%s。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="正在執行步驟 %d/%d：正在傳送請求佇列資料庫。目前已傳送 %s/%s。";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="正在執行步驟 %d/%d：正在開始與伺服器通訊";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="正在執行步驟 %d/%d：正在上傳前預先處理請求";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="正在執行步驟 %d/%d：正在等待下載";
